examples/dlfoam_hydrogen_planar/case_template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.0679245486; //Simulate 100 flame times first

deltaT          1.1e-06;

writeControl    timeStep;

writeInterval   1575;

purgeWrite      0;

writeFormat     binary;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   9;

runTimeModifiable true;

adjustTimeStep  no;

libs            ( "libchemistryModel_DLB.so" "libODE_DLB.so" "$FOAM_CASE/constant/mech/lib/libc_pyjac.so" "libFickianTransport.so" );


// ************************************************************************* //
