examples/dlfoam_hydrogen_planar/case_template/constant/mech/Allclean
#!/bin/bash
cd ${0%/*} || exit 1    # run from this directory

rm -rf lib
wclean src
