examples/dlfoam_hydrogen_planar/case_template/constant/mech/Allwmake
#!/bin/bash
cd ${0%/*} || exit 1    # run from this directory


mkdir -p lib
wmake libso src
