examples/dlfoam_hydrogen_planar/case_template/constant/mech/thermo/LewisNumbersDict
N2       1.3427878545103629;
H2       0.34593448691368744;
H        0.22714020748603125;
O2       1.3370149862652472;
O        0.8419799995504631;
H2O      1.10046637871272;
OH       0.857789738725218;
H2O2     1.3156432112574235;
HO2      1.3069225297192286;
NO       1.3251217049713877;
N2O      1.6937679696146666;
N        0.9440492960921769;
NH       0.7992592910137902;
NNH      1.335419777281412;
NH2      0.8160003122457513;
