examples/dlfoam_hydrogen_planar/case_template/constant/thermophysicalTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          thermophysicalTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

laminar
{
    model           mixtureAveraged;
    selfDiffusionLimit 1e-8;
    D
    {
        #include        "$FOAM_CASE/constant/mech/thermo/binaryDiffusionCoefficientsPolynomialDict"
    }
}


// ************************************************************************* //
