examples/dlfoam_hydrogen_planar/case_template/0/planarMappingDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
Lx              0.08064;

frontCoordinate 0.00586656;

frequency       34;

Ly              0.08064;

amplitude       8.064e-05;


// ************************************************************************* //
