examples/dlfoam_hydrogen_planar/case_template/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss cubic;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss limitedCubicV 0;
    div(phi,Yi_h)    Gauss limitedCubic  0;
    div(phic,Yi_h)   Gauss limitedCubic  0;
    div(phi,K)       Gauss limitedCubic  0;
    div(phic,K)      Gauss limitedCubic  0;
    div(phi,h)       Gauss limitedCubic  0;
    div(phic,h)      Gauss limitedCubic  0;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss cubic;

}

laplacianSchemes
{
    default         Gauss cubic orthogonal;
}

interpolationSchemes
{
    default         cubic;
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //
